{
    "menu": [
      {
        "id": 1,
        "name": "Classic Glazed",
        "description": "Our signature light and fluffy glazed doughnut",
        "price": 450,
        "oldPrice": 550,
        "image": "https://i.pinimg.com/736x/b2/20/ed/b220ed9f9578dacd5ef60523b10abaa5.jpg",
        "category": "classic"
      },
      {
        "id": 2,
        "name": "Chocolate Dream",
        "description": "Rich chocolate glazed with chocolate sprinkles",
        "price": 400,
        "oldPrice": 500,
        "image": "https://i.pinimg.com/236x/a1/e0/e7/a1e0e7ae1ca5202bc7a385c00993e3bd.jpg",
        "category": "premium"
      },
      {
        "id": 3,
        "name": "Cinnamon Blast",
        "description": "Filled with mixed berry compote",
        "price": 450,
        "oldPrice": 650,
        "image": "https://i.pinimg.com/236x/1c/20/fc/1c20fc94a61c196b4b99380753bea5bd.jpg",
        "category": "filled"
      },
      {
        "id": 3,
        "name": "Berry Blast",
        "description": "Filled with mixed berry compote",
        "price": 420,
        "oldPrice": 600,
        "image": "https://i.pinimg.com/236x/ee/ad/08/eead085443a35bca59fc560c67f0a514.jpg",
        "category": "filled"
      }
    ],
    "products": [
      {
        "id": 1,
        "name": "DIY Doughnut Kit",
        "description": "Make your own doughnuts at home",
        "price": 470,
        "oldPrice": 670,
        "image": "https://i.pinimg.com/236x/33/64/82/336482bb45c8e1dbb764be0d9b27f884.jpg",
        "rating": 4.5
      },
      {
        "id": 2,
        "name": "Fresh Doughnuts",
        "description": "No stale products over here.",
        "price": 670,
        "oldPrice": 970,
        "image": "https://i.pinimg.com/236x/f8/dd/6c/f8dd6cc52b089a2f06e2f3bde00cc551.jpg",
        "rating": 4.5
      },
      {
        "id": 3,
        "name": "Doughnut Party Box",
        "description": "24 assorted doughnuts perfect for parties",
        "price": 500,
        "oldPrice": 600,
        "image": "https://i.pinimg.com/236x/da/33/a4/da33a435cd238b12bd0df089935b9c89.jpg",
        "rating": 5
      }
    ],
    "review": [
      {
        "id": 1,
        "name": "Sarah Johnson",
        "avatar": "https://i.pinimg.com/236x/2d/4e/ad/2d4eada04d0b343c7ada90ebc6be93dc.jpg",
        "rating": 5,
        "text": "Best doughnuts in town! The Classic Glazed is absolutely perfect.",
        "date": "2024-05-15"
      },
      {
        "id": 2,
        "name": "Mike Peterson",
        "avatar": "https://i.pinimg.com/236x/e2/96/97/e29697f9bc4c829850f6c4e778b5174b.jpg",
        "rating": 4.5,
        "text": "Amazing variety and always fresh. The Berry Blast is my favorite!",
        "date": "2024-05-10"
      },
      {
        "id": 3,
        "name": "Dexter Morgan",
        "avatar": "https://i.pinimg.com/236x/bb/8a/91/bb8a91a047deaa78f7a89228f80d92da.jpg",
        "rating": 4.2,
        "text": "Every bite is a delight! The flavors are rich, and the freshness is unbeatable!",
        "date": "2024-05-10"
      }

    ],

    "blogs": [
      {
        "id": 1,
        "title": "The Art of Doughnut Making",
        "author": "admin",
        "date": "2024-05-21",
        "image": "https://i.pinimg.com/474x/f9/24/c4/f924c4829c1ab271a2168d501bc0cad8.jpg",
        "excerpt": "Discover the secrets behind our perfectly crafted doughnuts.",
        "content": "The art of doughnut making is a delicate blend of precision, creativity, and passion. It begins with crafting the perfect dough, a balance of flour, sugar, yeast, and other key ingredients, which must be mixed, kneaded, and allowed to rise to achieve a light, airy texture. The frying process is equally crucial, requiring the oil to be maintained at an optimal temperature to ensure a golden, crisp exterior while preserving a soft, fluffy interior. Beyond the basics, the artistry truly shines in the finishing touches: glazes, icings, and toppings are applied with care, transforming each doughnut into a masterpiece. From classic sugar coatings to intricate designs featuring edible decorations, every element reflects the maker's skill and creativity. This meticulous process results in doughnuts that not only satisfy the taste buds but also delight the eyes, elevating a simple treat into an indulgent experience."
      },
      {
        "id": 2,
        "title": "History of the Doughnut",
        "author": "admin",
        "date": "2024-05-18",
        "image": "https://i.pinimg.com/474x/64/55/17/645517c247f348d1a4f8e433544ec870.jpg",
        "excerpt": "From Dutch olykoeks to modern-day delights.",
        "content": "From Dutch olykoeks to modern-day delights. Over time, doughnuts evolved into a staple of American culture. These early versions were simply balls of sweetened dough fried in pork fat. The signature hole in the middle, a defining characteristic of modern doughnuts, is said to have been popularized in the mid-19th century by Hanson Gregory, an American ship captain, who claimed to have invented it to ensure even cooking of the dough. Over time, doughnuts evolved into a staple of American culture, particularly during World War I, when they were served to soldiers by volunteers, earning them the nickname doughboys.Today, doughnuts are celebrated globally, offered in countless variations, from classic glazed to gourmet creations, reflecting the enduring appeal of this delightful treat." 
      },
    {
      "id": 2,
      "title": "Tasty Doughnuts",
      "author": "admin",
      "date": "2024-05-18",
      "image": "https://i.pinimg.com/474x/24/7b/74/247b743aec5f0ff6f9fd750b68c2974c.jpg",
      "excerpt": "Discover the art of doughnut making and the stories behind our unique blends.",
      "content": "Discover the art of doughnut making and the stories behind our unique blends, where tradition meets innovation to create unforgettable flavors. Each doughnut begins as a carefully crafted dough, made from the finest ingredients and perfected through years of expertise. The process is a labor of love, from hand-kneading to the precise frying that gives each treat its golden, crisp exterior and tender interior. What sets our doughnuts apart is the creativity in our blends—infused with exotic spices, vibrant fruit essences, and house-made fillings that tell a story with every bite. Whether inspired by cherished family recipes or bold culinary experiments, our doughnuts are a celebration of flavor, passion, and artistry that goes beyond the ordinary." 
    }
  ]
  }